app/views/actions/_form.html.erb

         <%= f.fields_for :participants do |e|%>
         <% User.all.each do |d|%>
---
SELECT "users".* FROM "users"