app/controllers/actions_controller.rb

def show

  @action=Action.find_by_id(params[:id])
---
SELECT  "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", 1]]

 def index
   @actions=Action.all
   @user=User.all
---
SELECT "actions".* FROM "actions"
SELECT "users".* FROM "users"

 def create
  binding.pry
   @action = Action.new(action_params)
   @action.owner = current_user
   @action.users << User.find(params["participant"])
---
INSERT INTO "actions" ("event_title", "date", "time", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_title", "dasdsad"], ["date", "dsadsad"], ["time", "dsadsad"], ["description", "dsadasd"], ["created_at", "2016-11-15 07:04:08.844746"], ["updated_at", "2016-11-15 07:04:08.844746"]]
INSERT INTO "participants" ("user_id", "action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["action_id", 16], ["created_at", "2016-11-16 04:26:06.003385"], ["updated_at", "2016-11-16 04:26:06.003385"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]